src/cf/InformationRegisters/ТТС_ЖурналыТУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТТС_ЖурналыТУ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Остановки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПоездки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияЛокомотива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТС_СерииЛокомотивовЖТУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЛокомотива</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоезда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Станции_ТТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияПрибытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Станции_ТТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоСлучая</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНарушения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТС_КодыНарушенийЖТУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уточнение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативныйДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезолюцияСБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТС_КодыВидовМерЖТУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезолюцияМИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТС_КодыВидовМерЖТУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезолюцияНачальникаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТС_КодыВидовМерЖТУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальникДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаПринятыхМер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТС_КодыВидовМерЖТУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерПереключенияСветофора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТТС_ХарактерыПереключенияСветофоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВеденияПоезда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТТС_РежимыВеденияПоезда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛитерГоловнойСекции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТТС_ЛитерыГоловнойСекции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассетаКомментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНарушения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкоростьПоезда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭДТ</Name>
					<Comment>Электродинамическое торможение</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеВЛичномДеле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнутреннийДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИндексСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЖурнала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТТС_ВидыЖурналовТУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Машинист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТС_Машинисты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТС_Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТехникПоРасшифровке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСкоростемера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДСтроки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТТС_ВидыЖурналовТУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТТС_ВидыЖурналовТУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Журнал1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Журнал2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Журнал3</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ТТС_ЖурналыТУ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДанныеЖурнала(Документ, ИДСтроки = Неопределено) Экспорт
	НаборДанныеЖурнала = РегистрыСведений.ТТС_ЖурналыТУ.СоздатьНаборЗаписей();
	НаборДанныеЖурнала.Отбор.ВнутреннийДокумент.Установить(Документ);
	Если НЕ ИДСтроки = Неопределено Тогда
		НаборДанныеЖурнала.Отбор.ИДСтроки.Установить(ИДСтроки);
	КонецЕсли;
	НаборДанныеЖурнала.Прочитать();
	
	ДанныеЖурнала = НаборДанныеЖурнала.Выгрузить();
	Возврат ДанныеЖурнала;
КонецФункции

Процедура ЗаписатьДанныеЖурнала(Объект,ДанныеЖурнала) Экспорт
	НаборДанныеЖурнала = РегистрыСведений.ТТС_ЖурналыТУ.СоздатьНаборЗаписей();
	НаборДанныеЖурнала.Отбор.ВнутреннийДокумент.Установить(Объект.Ссылка);
	НаборДанныеЖурнала.Прочитать();                           
	НаборДанныеЖурнала.Очистить();
	Для Каждого СтрокаДанных Из ДанныеЖурнала Цикл
		Запись = НаборДанныеЖурнала.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,СтрокаДанных);
		Запись.ВнутреннийДокумент = Объект.Ссылка;
		Запись.ПометкаУдаления = Объект.ПометкаУдаления;
	КонецЦикла;
	НаборДанныеЖурнала.Записать();
	
	Если ДанныеЖурнала[0].ВидЖурнала = Перечисления.ТТС_ВидыЖурналовТУ.Журнал1 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТТС_ЖурналыТУ.ВнутреннийДокумент,
		               |	Ж1.Направление,
		               |	Ж1.Машинист,
		               |	Ж1.НомерСкоростемера,
		               |	Ж1.ДатаПоездки,
		               |	Ж1.НомерМаршрута,
		               |	Ж1.СерияЛокомотива,
		               |	Ж1.НомерЛокомотива,
		               |	Ж1.НомерПоезда,
		               |	Ж1.СтанцияОтправления,
		               |	Ж1.СтанцияПрибытия,
		               |	Ж1.ЭДТ
		               |ИЗ
		               |	РегистрСведений.ТТС_ЖурналыТУ КАК ТТС_ЖурналыТУ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТТС_ЖурналыТУ КАК Ж1
		               |		ПО ТТС_ЖурналыТУ.ИДСтроки = Ж1.ИДСтроки
		               |ГДЕ
		               |	ТТС_ЖурналыТУ.ИДСтроки В(&СтрокиОснования)
		               |	И НЕ ТТС_ЖурналыТУ.ВидЖурнала = ЗНАЧЕНИЕ(Перечисление.ТТС_ВидыЖурналовТУ.Журнал1)
		               |	И Ж1.ВидЖурнала = ЗНАЧЕНИЕ(Перечисление.ТТС_ВидыЖурналовТУ.Журнал1)";
		Запрос.УстановитьПараметр("СтрокиОснования",ДанныеЖурнала.ВыгрузитьКолонку("ИДСтроки"));
		ЖурналыВыборка = Запрос.Выполнить().Выбрать();
		СвойстваЖурнала1 = "Направление, 
							|Машинист, 
							|НомерСкоростемера, 
							|ДатаПоездки,
							|НомерМаршрута,
							|СерияЛокомотива, 
							|НомерЛокомотива, 
							|НомерПоезда, 
							|СтанцияОтправления, 
							|СтанцияПрибытия,
							|ЭДТ";
							
		НаборДанныеЖурнала = РегистрыСведений.ТТС_ЖурналыТУ.СоздатьНаборЗаписей();
		Пока ЖурналыВыборка.Следующий() Цикл
			НаборДанныеЖурнала.Отбор.ВнутреннийДокумент.Установить(ЖурналыВыборка.ВнутреннийДокумент);
			НаборДанныеЖурнала.Прочитать();                           
			ЗаполнитьЗначенияСвойств(НаборДанныеЖурнала[0],ЖурналыВыборка,СвойстваЖурнала1);
			НаборДанныеЖурнала.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОчиститьДанныеЖурнала(Объект) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	НаборДанныеЖурнала = РегистрыСведений.ТТС_ЖурналыТУ.СоздатьНаборЗаписей();
	НаборДанныеЖурнала.Отбор.ВнутреннийДокумент.Установить(Объект.Ссылка);
	НаборДанныеЖурнала.Прочитать();
	НаборДанныеЖурнала.Очистить();
	НаборДанныеЖурнала.Записать();
КонецПроцедуры

Процедура УстановитьСнятьПометкуУдаления(Объект,ПометкаУдаления) Экспорт
	НаборДанныеЖурнала = РегистрыСведений.ТТС_ЖурналыТУ.СоздатьНаборЗаписей();
	НаборДанныеЖурнала.Отбор.ВнутреннийДокумент.Установить(Объект.Ссылка);
	НаборДанныеЖурнала.Прочитать();
	Для Каждого Запись Из НаборДанныеЖурнала Цикл
		Запись.ПометкаУдаления = ПометкаУдаления;
	КонецЦикла;
	НаборДанныеЖурнала.Записать();
КонецПроцедуры


#КонецОбласти

#КонецЕсли
